/*:
## 주석
명확함과 가독성은 코드를 작성할 때 중요한 고려사항입니다. 프로그래머들은 짧은 메모를 코드에 남겨서 진행 상황을 설명합니다.
주석은 다른 사람들이 나중에 코드를 읽을 때 이해하는데 도움이 됩니다.
코드에 있는 메모들을 _comments(주석)_ 이라고 부릅니다.

주석은 놀이터에서 무시되며 코드 실행에 영향을 주지 않습니다.

주석은 빗금 두개 `//`로 시작합니다:
 */
// 이것은 주석입니다; 실행되는 코드에 영향을 주지 않습니다
// 34 + 56 + 230
//: 주석이 무시되기 때문에, 주석만으로 이뤄진 코드는 결과에 아무것도 표시되지 않습니다.
200 + 34 + 45
/*:
 - Experiment:
`34 + 56 + 230` 계산을 코드 앞에 빗금 두개를 추가해서 _주석처리_해봅니다.\
`200 + 34 + 45` 계산 코드 앞의 빗금 두개를 삭제해서 _주석처리해제_해봅니다. \
기존 계산식 중 일부를 수정해보고 새로 추가해봅니다. \
코드에 변동이 있을 때마다 결과가 사이드바에 업데이트되는 것을 확인합니다.
 */
 
/*:
 프로그래머들은 종종 작성한 코드를 주석처리하거나 주석처리해제합니다. 하지만 이보다 더 중요한 주석의 용도가 있습니다. 코드를 작성할 때는 항상 코드에 대한 정보를 기록해야합니다. 문서화하는 것은 특정 결정을 왜 했는지를 기록하고 코드가 어떻게 동작하는지를 설명합니다. 설명 자료를 다른 파일에 작성할 수 있지만, 코드에 대한 설명이 코드 자체와 같은 위치에 있을 때 더 읽기 쉽습니다. 프로그래머들은 코드를 작성하면서 문서화도 같이 하기 위해 주석을 사용합니다.
 
 예를들어, 위에서 한 계산이 무엇을 계산한 것일까요? 주석을 쓰면 코드가 명확해집니다.
 */
// 총액 (천원): 저금통, 지갑, 은행 계조
34 + 56 + 230

// 분단위 바이올린 연습시간: 지지난주, 지난주, 이번주
200 + 34 + 45
/*:
심호흡 한번 하시고 다음 페이지로 넘어가시죠.

[이전](@previous)  |  페이지 4 / 7  |  [다음: 뭔가 잘못됐을 때 😰](@next)
 */
