/*:
## 뭔가 잘못됐을 때 😰
프로그래머들도 실수를 합니다.\
(당신이 상상하는 것보다 훨씬 더 자주 실수합니다.)

당신이 코드를 작성하고 앱을 만들 때, 당신도 실수를 할 것입니다.

_Don't panic (당황하지 마세요)._

가끔 코드를 작성할 때 뭔가 잘못됩니다. 이것은 지극히 정상적인 것입니다.\
오류 없이 모든 것이 기대한대로 될 것이라고 기대하지 마세요.

뭔가 잘못됐을 때 문제를 해결하는 것은 프로그래밍의 일부입니다.

여기서 첫번째 단계는 놀라지 않는 것입니다. 심호흡을 하세요.

 _Don't panic (당황하지 말세요)._

오류는 당신이 실패했다거나 당신이 나쁜 프로그래머라는 것을 의미하지 않습니다.\
그저 코드 안에 문제가 있고 당신이 해결해야된다는 것을 의미할 뿐입니다.

이는 모두 작업의 일부분입니다.

다음 페이지에서 놀이터가 어떻게 오류를 찾는것을 돕는지 보세요.

[이전](@previous)  |  페이지 5 / 7  |  [다음: 오류](@next)
 */
