/*:
## 오류
놀이터가 코드에서 오류를 발견하면 실행을 멈춥니다.
본 놀이터 페이지에서는, 한 예로 코드 안에 오류가 있습니다.

👇 아래 코드 한줄이 빨간색으로 표시되어 있는 것을 보세요. 이는 놀이터가 어디에 문제가 있는지 말해주는 방법입니다.
오른쪽에는 오류 기호와 문제에 대한 설명이 있습니다.

 ![0으로 나누기 오류 설명과 오류 기호](DivisionByZeroError.png)
 */
1000 / 0
/*:
오류가 있기 때문에 놀이터는 코드 실행을 정지합니다.\
사이드바에 표시된 결과가 없음을 보세요 👉
 */
2 + 2
/*:
이 경우 오류는 "0으로 나누기"입니다. 수학 수업에서도 0으로 나눌 수 없고, 컴퓨터도 마찬가지로 0으로 나누지 못합니다.

 - Experiments:
오류를 고치기 위해 `0`을 다른 숫자로 바꿔보세요.

다음으로, 방금 전에 한 모든 것에 대해 읽어보세요.

[이전](@previous)  |  페이지 6 / 7  |  [다음: 마무리](@next)
 */
