/*:
## 놀이터란 무엇인가?
놀이터는 코드를 써보고 실험해볼 수 있는 - 그리고 즉시 결과를 볼 수 있는 - 공간으로 코딩 도중에 방해받지 않습니다. 놀이터에는 내용을 설명하는 부분(본 텍스트처럼)과 변경 가능한 코드가 섞여있습니다.

가장 간단한 _코드 한줄_로 숫자를 입력할 수 있습니다:
 */
765
/*:
👆위 숫자가 다르게 보이는 것을 인지하셨나요?
이런 글자체를 *수정가능한 코드*라고 하며, 여기에 실행가능한 코드를 작성하거나 변경가능합니다.

음의 숫자에는 마이너스 부호를 붙여줍니다:
 */
-120000
/*:
오른쪽 회색 영역에 숫자가 표시되는 것이 보이시나요? 👉

숫자가 표시된 영역을 _결과 사이드바_라고 부릅니다. 코드를 추가하거나 변경하면, 놀이터가 코드를 다시 실행하고 그 결과를 사이드바에 업데이트 합니다.

 - 실험:
   - 코드를 클릭해서 마우스 커서를 위치시킵니다.
   - 코드를 수정을 시작하기 위해 타이핑합니다.
   - 숫자를 몇번 바꿔봅니다.
   - 새로운 줄에 숫자들을 새로 추가합니다.

코드에 변화가 있을 때마다 새로 실행된 결과가 사이드바에 업데이트 되는 것을 보세요.

다음으로, 사이드바에 넣은 결과들을 어떻게 더 잘쓸 수 있는지 보세요.
 
[이전](@previous)  |  페이지 2 / 7  |  [다음: 계산](@next)
 */
